{
  "name": "Lucas",
  "headerTaglineOne": "Hi 🌱",
  "headerTaglineTwo": "I'm Lucas Duport",
  "headerTaglineThree": "A passionate student",
  "headerTaglineFour": "based in Paris, France.",
  "showBlog": false,
  "darkMode": true,
  "socials": [
    { "id": "1", "title": "Github", "link": "https://github.com/lucasduport" },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/lucas-duport/"
    },
    {
      "id": "3",
      "title": "Resume",
      "link": "/resume"
    },
    { "id": "4", "title": "Email", "link": "mailto:cv.lucasduport@icloud.com" }
  ],
  "projects": [
    {
      "id": "1",
      "title": "WhatsUpDoc",
      "description": "This project lead us to the final of Google Hackathon. WhatsUpDoc is a conversational human-like avatar AI assistant that guides patients through a pre-diagnosis with our specialized MedGemma-4B model before taking a medical appointment.",
      "imageSrc": "/images/preview-whatsupdoc.png",
      "url": "https://whatsupdoc-web-app.vercel.app/"
    },
    {
      "id": "2",
      "title": "La Télécommande",
      "description": "This project was voted the People's Choice Award at the Mistral MCP Hackathon. La Télécommande turns Mistral into a DevOps co-pilot. From a simple prompt, you can configure servers, deploy apps, or run commands across any machine, locally or remotely.",
      "imageSrc": "/images/preview-latelecommande.png",
      "url": "https://github.com/Mistral-MCP-Hackathon-2025/mcp-la_telecommande"
    },
    {
      "id": "3",
      "title": "Short Video Recommender System",
      "description": "Developed a content-based video recommendation system using the KuaiRec dataset, achieving 85% precision by leveraging user interactions and video metadata.",
      "imageSrc": "/images/preview-recommender.png",
      "url": "https://github.com/lucasduport/Final_Project_2025_Lucas_Duport"
    },
    {
      "id": "4",
      "title": "Ship Classification",
      "description": "Built a CNN to classify 13 ship types from 32×32 images under a 30-layer limit. Boosted accuracy with progressive training and balanced augmentation across phases while preventing overfitting through early stopping and LR scheduling.",
      "imageSrc": "/images/preview-ship.png",
      "url": "https://github.com/lucasduport/ship-classification"
    },
    {
      "id": "5",
      "title": "Distributed IoT Ring Health Analytics System",
      "description": "A scalable IoT system for monitoring health data from smart rings. It uses a microservices architecture with Kafka for real-time data streaming, MinIO for storage, and Apache Spark for analysis, featuring real-time anomaly detection and alerting.",
      "imageSrc": "/images/preview-iotring.png",
      "url": "https://github.com/lucasduport/iot-ring-monitoring"
    },
    {
      "id": "6",
      "title": "Classification and Generation of reviews",
      "description": "Developed an NLP pipeline for predicting and generating TripAdvisor hotel reviews using classification and text generation models.",
      "imageSrc": "/images/preview-tripadvisor.jpg",
      "url": "https://github.com/ArthurCourselle/NLP_TripAdvisorReviews"
    },
    {
      "id": "7",
      "title": "My own infrastructure as code",
      "description": "Building a personal infrastructure as code while a simple setup for GitOps (Portainer EE + GitHub).",
      "imageSrc": "/images/preview-infra.png",
      "url": "https://github.com/lucasduport/infra"
    },
    {
      "id": "8",
      "title": "Sudoku OCR",
      "description": "Built a complete OCR system to detect, recognize, and solve Sudoku grids (and Hexadoku) from images. Implemented the entire image processing pipeline manually (resizing, rotation, filtering, Hough transform, grid extraction) without relying on external libraries. Custom neural networks (TMNIST, MNIST, EMNIST datasets), achieving over 96% accuracy.",
      "imageSrc": "/images/preview-sudoku.png",
      "url": "https://github.com/lucasduport/sudoku-ocr"
    }
  ],
  "services": [],
  "aboutpara": "Passionate EPITA student, curious, devoted, and pedagogical. I love sharing, traveling, skiing, watchmaking, and new technologies. My home lab allows me to have my own server to host services and do recreational deployments.",
  "showCursor": true,
  "recommendations": [
    {
      "name": "Philippe VIALLETELLE",
      "position": "Senior Member of Technical Staff, Manufacturing Data & Analytics Program",
      "company": "STMicroelectronics",
      "linkedin": "https://www.linkedin.com/in/philippe-vialletelle-3066a63/",
      "companyLogo": "/images/st.png",
      "companyUrl": "https://www.st.com",
      "citations": [
        "Lucas took on the challenging task of completely reengineering a proof-of-concept tool to finally propose an innovative solution for maintenance technicians leveraging generative AI techniques.",
        "Lucas consistently exhibited a proactive attitude, excellent teamwork, and effective communication skills, making valuable contributions to our team discussions and project milestones.",
        "The solution developed by Lucas is today being deployed as a pilot at 3 other factories to support the definition of our future industrial solution for maintenance line engineers and technicians."
      ],
      "letterUrl": "/letters/recommendation-st.pdf"
    }
  ]
}
